Торговля_11__демо/src/Catalogs/УчетныеЗаписиМаркетплейсов/УчетныеЗаписиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиМаркетплейсов</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегории</name>
    <type>
      <types>EnumRef.ИсточникиКатегорийДляМаркетплейса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Торговля_11__демо/src/Enums/ВидыМаркетплейсов/ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркетплейсов</name>
  <enumValues>
    <name>МаркетплейсЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>МаркетплейсOzon</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/СпособыЗаданияЦен/СпособыЗаданияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаданияЦен</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБ</name>
  </enumValues>
  <enumValues>
    <name>РассчитыватьПоФормуламОтДругихВидовЦен</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПриПоступлении</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаЦенуПоступления</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаЦенуВводаОстатков</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаДругойВидЦен</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоКонкурентам</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяИзЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяСOzon</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БазовыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЦены</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательнаяЦена</name>
    <comment>Цена заполняется, но не записывается. Используется как вспомогательная для сложных расчетов других цен</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеЦеныЗаПределамиОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриВыпускеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриОптовойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеПродукцииДавальцу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПродаже</name>
    <comment>Устанавливается если выбраны при оптовой или розничной продажах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриРозничнойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьОтборНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Округлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатывания</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатыванияПриУменьшении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияЦены</name>
    <type>
      <types>EnumRef.СпособыЗаданияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДействияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <comment>Общий / Индивидуальный</comment>
    <type>
      <types>EnumRef.НазначенияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЦенуПриВводеНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанныхОтбораПоНоменклатуре</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекПараметровСпособаЗаданияЦены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВлияющиеВидыЦен</name>
    <attributes>
      <name>ВлияющийВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОкругленияЦены</name>
    <attributes>
      <name>НижняяГраницаДиапазонаЦен</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочностьОкругления</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическоеОкругление</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСрабатывания</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатывания</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатыванияПриУменьшении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Валюты</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЦены</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Торговля_11__демо/src/Catalogs/УчетныеЗаписиМаркетплейсов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает хеш настроек для переданной структуры настроек.
//
// Параметры:
//  СтруктураНастроек - Структура - структура с ключами настроек, см. СтрокаИменНастроекУчетнойЗаписи().
// 
// Возвращаемое значение:
//  ХешСумма - строковое представление хеш суммы.
//
Функция ПолучитьХешНастроек(СтруктураНастроек) Экспорт
	
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.ПолучитьХешСтроки(ЗначениеВСтрокуВнутр(СтруктураНастроек));
	
КонецФункции

// Возвращает хеш настроек для учетной записи.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись, для которой необходимо вернуть хеш настроек.
// 
// Возвращаемое значение:
//  ХешСумма - строковое представление хеш суммы.
//
Функция ПолучитьХешНастроекПоСсылке(УчетнаяЗапись) Экспорт 
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	СтруктураНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, СтрокаИменНастроекУчетнойЗаписи());
	
	СтруктураНастроек.Вставить("ВидыЦен", СтруктураНастроек.ВидыЦен.Выгрузить());
	
	Возврат ПолучитьХешНастроек(СтруктураНастроек);
	
КонецФункции

// Возвращает доступную учетную запись в случае, если она является единственной в справочнике.
//
//  В случае отсутствия записей или наличия более одной возвращается пустая ссылка.
//
// Параметры:
//  ВидМаркетплейса	 - ПеречислениеСсылка.ВидыМаркетплейсов - Вид маркетплейса для получения учетной записи.
//
// Возвращаемое значение:
//  СправочникСсылка.НастройкиИнтеграцииСМаркетплейсом - Учетная запись по-умолчанию.
//
Функция ОсновнаяУчетнаяЗапись(ВидМаркетплейса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	УчетныеЗаписиМаркетплейсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
	|ГДЕ
	|	УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса
	|	И УчетныеЗаписиМаркетплейсов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВидМаркетплейса", ВидМаркетплейса);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка");
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка");
	КонецЕсли;

	Выборка.Следующий();
	Возврат Выборка.Ссылка;

КонецФункции

// Возвращает структуру с настройками учетной записи.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - Учетная запись для получения настроек.
// 
// Возвращаемое значение:
//  Структура - Настройки учетной записи, см. Справочники.УчетныеЗаписиМаркетплейсов.СтрокаИменНастроекУчетнойЗаписи()
//
Функция НастройкиУчетнойЗаписи(УчетнаяЗапись) Экспорт

	ЗначенияНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, СтрокаИменНастроекУчетнойЗаписи());

	ВидыЦен = Новый Структура;
	ОписаниеВидовЦен = ОписаниеВидовЦенУчетнойЗаписи(ЗначенияНастроек.ВидМаркетплейса);
	
	Для Каждого ОписаниеВидаЦен Из ОписаниеВидовЦен Цикл
		ВидыЦен.Вставить(ОписаниеВидаЦен.Ключ, ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	КонецЦикла;

	Если ЗначенияНастроек.ВидыЦен <> Неопределено Тогда
		Выборка = ЗначенияНастроек.ВидыЦен.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ВидыЦен.Свойство(Выборка.ИмяНастройки) Тогда
				ВидыЦен[Выборка.ИмяНастройки] = Выборка.ВидЦены;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ЗначенияНастроек.ВидыЦен = ВидыЦен;

	Возврат ЗначенияНастроек;

КонецФункции

// Возвращает информацию по видам цен учетной записи.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись, для которой необходимо вернуть хеш настроек.
// 
// Возвращаемое значение:
//  Структура - ключом является идентификатор вида цены на маркетплейсе, значением информация по виду цены.
//
Функция ВидыЦенУчетнойЗаписи(УчетнаяЗапись) Экспорт

	ВидыЦенУчетнойЗаписи = Новый Структура;
	
	НастройкиУчетнойЗаписи = НастройкиУчетнойЗаписи(УчетнаяЗапись);
	ВидыЦен = НастройкиУчетнойЗаписи.ВидыЦен;
	ОписаниеВидовЦен = ОписаниеВидовЦенУчетнойЗаписи(НастройкиУчетнойЗаписи.ВидМаркетплейса);

	Для Каждого ДанныеВидаЦен Из ВидыЦен Цикл
		ОписаниеВидаЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидовЦен, ДанныеВидаЦен.Ключ, Неопределено);
		ТребуетсяПроверкаЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидаЦен, "ПроверкаЗаполнения", Ложь);
		ПредставлениеВидаЦены = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидаЦен, "ПредставлениеВидаЦены", "");

		СтруктураДанныхВидаЦен = Новый Структура;
		СтруктураДанныхВидаЦен.Вставить("ВидЦены", ДанныеВидаЦен.Значение);
		СтруктураДанныхВидаЦен.Вставить("ПроверкаЗаполнения", ТребуетсяПроверкаЗаполнения);
		СтруктураДанныхВидаЦен.Вставить("ПредставлениеВидаЦены", ПредставлениеВидаЦены);

		ВидыЦенУчетнойЗаписи.Вставить(ДанныеВидаЦен.Ключ, СтруктураДанныхВидаЦен);
	КонецЦикла;

	Возврат ВидыЦенУчетнойЗаписи;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру с именами видов цен и признаком проверки заполнения цены.
//
// Возвращаемое значение:
//  Структура, где ключ - имя настройки с видом цен, значение - структура с ключами:
//								ПредставлениеВидаЦены - Строка - представление вида цены в форме настроек синхронизации,
//								ПроверкаЗаполнения - Булево - признак необходимости проверки заполнения цены.
//
Функция ОписаниеВидовЦенУчетнойЗаписи(ВидМаркетплейса)

	ОписаниеВидовЦен = Новый Структура;
	
	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon")
		Или Не ЗначениеЗаполнено(ВидМаркетплейса) Тогда

		ТипыЦен = ИнтеграцияСМаркетплейсамиСерверЛокализация.ТипыЦенOzon(Истина, Ложь);
		Для каждого ТипЦен Из ТипыЦен Цикл
			ДанныеВидаЦены = Новый Структура("ПредставлениеВидаЦены, ПроверкаЗаполнения",
					ТипЦен.Наименование, ТипЦен.ОбязательноеЗаполнение);
			ОписаниеВидовЦен.Вставить(ТипЦен.Идентификатор, ДанныеВидаЦены);
		КонецЦикла;
		
	КонецЕсли;

	Возврат ОписаниеВидовЦен;

КонецФункции

Функция СтрокаИменНастроекУчетнойЗаписи()
	
	СтрокаИменНастроекУчетнойЗаписи =
			"ВидМаркетплейса, Организация, ИдентификаторКлиента, ИсточникКатегории, ВалютаУчета, ВидыЦен";
	Возврат СтрокаИменНастроекУчетнойЗаписи;
	
КонецФункции

// Возвращает виды цен учетных записей маркетплейса Ozon.
// 
// Возвращаемое значение:
//  Массив - массив видов цен учетных записей маркетплейса Ozon.
//
Функция ВидыЦенУчетныхЗаписейМаркетплейсаOzon() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыЦенУчетныхЗаписей.ВидЦены КАК ВидЦены
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов.ВидыЦен КАК ВидыЦенУчетныхЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
	|		ПО ВидыЦенУчетныхЗаписей.Ссылка = УчетныеЗаписиМаркетплейсов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК СправочникВидыЦен
	|		ПО (СправочникВидыЦен.Ссылка = ВидыЦенУчетныхЗаписей.ВидЦены)
	|ГДЕ
	|	НЕ УчетныеЗаписиМаркетплейсов.ПометкаУдаления
	|	И УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.МаркетплейсOzon)
	|	И НЕ ВидыЦенУчетныхЗаписей.ВидЦены = ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
	|	И НЕ СправочникВидыЦен.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЦен.Ссылка
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиМаркетплейсов.ВидыЦен КАК ВидыЦенУчетныхЗаписей
	|		ПО ВидыЦен.Ссылка = ВидыЦенУчетныхЗаписей.ВидЦены
	|ГДЕ
	|	НЕ ВидыЦен.ПометкаУдаления
	|	И ВидыЦен.СпособЗаданияЦены = ЗНАЧЕНИЕ(Перечисление.СпособыЗаданияЦен.ЗагружаетсяСOzon)
	|	И ВидыЦенУчетныхЗаписей.ВидЦены ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Выгрузка = Результат.Выгрузить();
	Возврат Выгрузка.ВыгрузитьКолонку("ВидЦены");

КонецФункции

// Возвращает количество подключений к площадке маркетплейса.
//
// Параметры:
//  ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса.
// 
// Возвращаемое значение:
//  Число - количество подключений.
//
Функция ПолучитьКоличествоПодключений(ВидМаркетплейса) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидМаркетплейса", ВидМаркетплейса);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЗаписиМаркетплейсов.Ссылка), 0) КАК КоличествоПодключений
	|ИЗ
	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
	|ГДЕ
	|	НЕ УчетныеЗаписиМаркетплейсов.ПометкаУдаления
	|	И УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.КоличествоПодключений;

КонецФункции

#КонецОбласти

#КонецЕсли
